[
    {
      "city": "Paris",
      "country": "France",
      "clues": [
        "This city is home to a famous tower that sparkles every night.",
        "Known as the 'City of Love' and a hub for fashion and art."
      ],
      "fun_fact": [
        "The Eiffel Tower was supposed to be dismantled after 20 years but was saved because it was useful for radio transmissions!",
        "Paris has only one stop sign in the entire city—most intersections rely on priority-to-the-right rules."
      ],
      "trivia": [
        "This city is famous for its croissants and macarons. Bon appétit!",
        "Paris was originally a Roman city called Lutetia."
      ]
    },

    {
      "city": "Tokyo",
      "country": "Japan",
      "clues": [
        "This city has the busiest pedestrian crossing in the world.",
        "You can visit an entire district dedicated to anime, manga, and gaming."
      ],
      "fun_fact": [
        "Tokyo was originally a small fishing village called Edo before becoming the bustling capital it is today!",
        "More than 14 million people live in Tokyo, making it one of the most populous cities in the world."
      ],
      "trivia": [
        "The city has over 160,000 restaurants, more than any other city in the world.",
        "Tokyo’s subway system is so efficient that train delays of just a few minutes come with formal apologies."
      ]
    },

    {
      "city": "New York",
      "country": "USA",
      "clues": [
        "Home to a green statue gifted by France in the 1800s.",
        "Nicknamed 'The Big Apple' and known for its Broadway theaters."
      ],
      "fun_fact": [
        "The Statue of Liberty was originally a copper color before oxidizing to its iconic green patina.",
        "Times Square was once called Longacre Square before being renamed in 1904."
      ],
      "trivia": [
        "New York City has 468 subway stations, making it one of the most complex transit systems in the world.",
        "The Empire State Building has its own zip code: 10118."
      ]
    },

    {
      "city": "London",
      "country": "United Kingdom",
      "clues": [
        "This city has a clock tower that people often mistake as being called Big Ben.",
        "The River Thames runs through the heart of this historic capital."
      ],
      "fun_fact": [
        "Big Ben is actually the name of the bell inside the Elizabeth Tower, not the tower itself!",
        "London has more than 170 museums, including the British Museum, which has over 8 million objects."
      ],
      "trivia": [
        "Black cabs in London require drivers to pass 'The Knowledge,' one of the toughest taxi exams in the world.",
        "London was the first city in the world to have an underground railway, known as the Tube."
      ]
    },

    {
      "city": "Rome",
      "country": "Italy",
      "clues": [
        "This city is home to the Colosseum, an ancient amphitheater.",
        "It has a country within its borders—the smallest in the world!"
      ],
      "fun_fact": [
        "Vatican City, the smallest country in the world, is located entirely within Rome.",
        "There’s a keyhole in Rome where you can see three countries at once: Italy, Vatican City, and Malta."
      ],
      "trivia": [
        "Romans invented concrete, revolutionizing architecture.",
        "The Pantheon’s dome is still the largest unreinforced concrete dome in the world."
      ]
    },

    {
      "city": "Sydney",
      "country": "Australia",
      "clues": [
        "This city is famous for its Opera House with a sail-like design.",
        "A giant bridge nicknamed 'The Coathanger' spans its harbor."
      ],
      "fun_fact": [
        "The Sydney Opera House took 14 years to build and was initially expected to take only 4.",
        "Sydney has over 100 beaches, including the world-famous Bondi Beach."
      ],
      "trivia": [
        "Sydney’s Harbour Bridge is the largest steel arch bridge in the world.",
        "The city was founded as a British penal colony in 1788."
      ]
    },

    {
      "city": "Rio de Janeiro",
      "country": "Brazil",
      "clues": [
        "A giant statue of Christ overlooks this vibrant city.",
        "Home to one of the most famous carnival celebrations in the world."
      ],
      "fun_fact": [
        "The Christ the Redeemer statue was struck by lightning in 2014, causing minor damage to one of its fingers.",
        "Rio's Copacabana Beach hosts one of the largest New Year's Eve parties in the world."
      ],
      "trivia": [
        "The name 'Rio de Janeiro' means 'River of January' in Portuguese, even though there is no river.",
        "Sugarloaf Mountain offers breathtaking views of the city and the Atlantic Ocean."
      ]
    },
    {
        "city": "Cairo",
        "country": "Egypt",
        "clues": [
          "Overlooks the ancient Pyramids of Giza and the Great Sphinx.",
          "The Nile River, the longest in the world, flows through this city."
        ],
        "fun_fact": [
          "Cairo's 'City of the Dead' is a 4-mile-long cemetery where people live among tombs.",
          "The Great Pyramid was the tallest human-made structure for 3,800 years."
        ],
        "trivia": [
          "Cairo is nicknamed 'The City of a Thousand Minarets' for its Islamic architecture.",
          "The first recorded labor strike in history occurred here during Pharaoh Ramses III’s reign."
        ]
      },
      
      {
        "city": "Tokyo",
        "country": "Japan",
        "clues": [
          "Famous for Shibuya Crossing, the world's busiest pedestrian intersection.",
          "The Tokyo Skytree is the tallest freestanding broadcasting tower globally."
        ],
        "fun_fact": [
          "Tokyo has over 14 Michelin three-star restaurants—more than any other city.",
          "Vending machines here sell everything from hot ramen to umbrellas."
        ],
        "trivia": [
          "Tokyo was named Edo until 1868 and means 'Eastern Capital' in Japanese.",
          "The city’s subway system has women-only cars during rush hour for safety."
        ]
      },
      
      {
        "city": "Cape Town",
        "country": "South Africa",
        "clues": [
          "Nestled beneath Table Mountain, a flat-topped natural wonder.",
          "Located near the Cape of Good Hope, a historic maritime route."
        ],
        "fun_fact": [
          "The Noon Gun, fired daily since 1806, uses one of the oldest cannons in continuous use.",
          "Boulders Beach is home to a colony of endangered African penguins."
        ],
        "trivia": [
          "Cape Town’s Kirstenbosch Garden is part of a UNESCO World Heritage Site.",
          "The city hosted Africa’s first FIFA World Cup match in 2010."
        ]
      },
      
      {
        "city": "Sydney",
        "country": "Australia",
        "clues": [
          "Famous for its sail-shaped Sydney Opera House and Harbour Bridge.",
          "Bondi Beach, a iconic surfing spot, lies within the city."
        ],
        "fun_fact": [
          "The Sydney Opera House roof contains over 1 million self-cleaning tiles.",
          "Sydney’s New Year’s Eve fireworks are among the first to welcome the new year globally."
        ],
        "trivia": [
          "Sydney was named after British Home Secretary Lord Sydney in 1788.",
          "The Sydney to Hobart Yacht Race is one of the world’s toughest ocean races."
        ]
      },
      {
        "city": "New York City",
        "country": "United States",
        "clues": [
          "The Statue of Liberty stands in its harbor as a symbol of freedom.",
          "Times Square here hosts the iconic New Year's Eve ball drop."
        ],
        "fun_fact": [
          "Central Park has a secret underground vault that stores antique carousel parts.",
          "The NYC subway system ran 24/7 even during the construction of the Panama Canal."
        ],
        "trivia": [
          "New York City was briefly the U.S. capital from 1789 to 1790.",
          "The city’s library lions, Patience and Fortitude, are named after virtues from the Great Depression."
        ]
      },
      
      {
        "city": "Rome",
        "country": "Italy",
        "clues": [
          "Home to the Colosseum, an ancient amphitheater that hosted gladiatorial contests.",
          "The Vatican City, the smallest independent state, lies within this city."
        ],
        "fun_fact": [
          "Romans throw coins into the Trevi Fountain daily—€3,000+ is donated to charity yearly.",
          "The city has a cat sanctuary at Largo di Torre Argentina, where Julius Caesar was assassinated."
        ],
        "trivia": [
          "Rome’s Pantheon has a hole in its dome that creates a 'rain column' effect during storms.",
          "The Spanish Steps were funded by French diplomat Étienne Gueffier in the 18th century."
        ]
      },
      
      {
        "city": "Bangkok",
        "country": "Thailand",
        "clues": [
          "Known for ornate temples like Wat Arun and the Grand Palace.",
          "Floating markets and street food stalls dominate its canals and streets."
        ],
        "fun_fact": [
          "Bangkok’s full ceremonial name is 163 letters long (Guinness World Record).",
          "The city’s Suvarnabhumi Airport has a rooftop Muay Thai boxing ring."
        ],
        "trivia": [
          "Bangkok translates to 'City of Angels' in Thai.",
          "The world’s largest solid gold Buddha statue (5.5 tons) resides at Wat Traimit."
        ]
      },
      
      {
        "city": "Dubai",
        "country": "United Arab Emirates",
        "clues": [
          "Home to the Burj Khalifa, the tallest building in the world.",
          "Features artificial islands shaped like palm trees and a world map."
        ],
        "fun_fact": [
          "Dubai Police patrol in Lamborghinis, Ferraris, and a $1.6 million Aston Martin.",
          "The city has an indoor ski slope in the Mall of the Emirates—despite desert heat."
        ],
        "trivia": [
          "Dubai’s gold trade accounts for 25% of global physical gold transactions.",
          "The Dubai Fountain shoots water 500 feet high (equivalent to a 50-story building)."
        ]
      },
      
      {
        "city": "Buenos Aires",
        "country": "Argentina",
        "clues": [
          "Known as the 'Paris of South America' for its European-style architecture.",
          "Birthplace of the tango dance and home to colorful La Boca neighborhood."
        ],
        "fun_fact": [
          "The city’s Teatro Colón has a secret room designed for perfect acoustics: the “Sala de los escamoteos.”",
          "Buenos Aires has more bookstores per capita than any other city globally."
        ],
        "trivia": [
          "The name means 'Good Airs' in Spanish, referencing its founding during fair weather.",
          "The Obelisco monument was built in just 31 days for the city’s 400th anniversary."
        ]
      },
      
      {
        "city": "Venice",
        "country": "Italy",
        "clues": [
          "Built on 118 small islands connected by canals and bridges.",
          "Hosts the annual Carnival of Venice with elaborate masks and costumes."
        ],
        "fun_fact": [
          "Venice’s canals glow bioluminescent blue at night during algae blooms.",
          "Residents navigate the city using gondolas, traghetti ferries, and water taxis."
        ],
        "trivia": [
          "The Rialto Bridge was the only way to cross the Grand Canal on foot until 1854.",
          "Venice’s St. Mark’s Basilica houses looted treasures from the Sack of Constantinople."
        ]
      }
  ]
  